# -*- coding: utf-8 -*-
"""Копия блокнота "Практика 0.3.0.ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1Oj16Jc68lR8bZAHyDHpUUvShq80cvG7k

ФИО
"""

КУчерявин Кирилл

"""**Во всей практике нельзя применять библиотеки предоставляющие готовые решения!**

# **Задача 1.**

Типы данных Напишите программу на Python, которая принимает список чисел в качестве входных данных от пользователя, а затем выводит сумму, среднее значение и максимальное значение из списка.

***Нельзя использовать: len(), min(), max(), average(), sum()***

Дано:
```
1 2 3 4 5 6 7
```
Вывод:

```
Сумма чисел: 28
Среднее арифм.: 4.0
Максимальное значение: 7
```
"""

a = input('введите числа через пробел: ').split()
def f(v):

    v1 = len(v)
    b = 0
    for i in v:
        mx = 0
        if int(i) >= mx:
            mx = int(i)
        b += int(i)
        m = b / v1

    print('сумма:', b, 'ср. арифметическое:', m, "максимальное:", mx)
f(a)

"""# **Задача 2.**

Напишите программу на Python, которая принимает список слов в качестве входных данных от пользователя, а затем распечатывает список в обратном порядке.

Ввод:

```
апельсин мандарин яблоко
```

Вывод:

```
яблоко мандарин апельсин
```
"""

a = input('введите слова через пробел: ').split()
m = []
b = len(a)
for i in range(1, b):
    m.append(a[-i])
m.append(a[0])
print(m)

"""# **Задача 3**

Простой чат-бот
Создайте простого чат-бота, который отвечает на основные запросы пользователей. Программа должна использовать условные выражения для определения намерений пользователя и последующего соответствующего ответа.

Чат бот может:

- помогать складывать числа
- подсказывать фильм, музыку и тд (из заранее созданного списка)
- создавать список дел (а также выводить его, обновлять, очищать)

Интерфейс чат-бота на ваше усмотрение, это могут быть как заранее определенные команды, так и к примеру вызов команды по номеру

*Реализовать без использования функций*

Пример:

Ввод:

```
Олег, какую мызыку посоветуешь?
```

Вывод:

```
Я бы посоветовал вам: Led Zeppelin Stairway to Heaven
```
"""

import random
print('Вас приветствует чат-бот Оксана!!!'
      'Вот список команд которые я могу выполнять, введите необходимую цифру и я вам отвечу!!!(введите только одну цифру и больше ничего!!!!)')
while True:
    a = int(input('1.Сложи числа\n \
          2.Посоветуй фильм\n \
          3.Посоветуй музыку\n \
          4.Создай\обнови\очисти список дел\n \
          5.Выйти\n: '))


    if a == 1:
        sm = 0
        while True:
            s = (input('Введите число: '))
            if s == '':
                break
            sm += int(s)
            if s == '':
                break
        print(sm)


    if a == 2:
        a1 = 'Советую Зеленая миля'
        a2 = 'Советую Мальчик в полосатой пижаме'
        a3 = 'Советую Интерстеллар'
        a4 = randint(1, 3)
        if a4 == 1:
            print(a1)
        if a4 == 2:
            print(a2)
        if a4 == 3:
            print(a3)



    if a == 3:
        a1 = 'Советую трек Номинало бай Моргенштерн'
        a2 = 'Советую трек Царица от Королевы Анечки Асти'
        a3 = 'Советую трек Грустный денс от Артика и Асти'
        a4 = randint(1, 3)
        if a4 == 1:
            print(a1)
        if a4 == 2:
            print(a2)
        if a4 == 3:
            print(a3)


    if a == 4:
        sp = []
        while True:
            print('выберите что хотите сделать!!!(запишите только одну цифру)')
            a1 = int(input('1.создать список дел\n \
                   2.вывести список дел\n \
                   3.добавить дела в список дел\n \
                   4.очистить список дел\n \
                    5.Выйти   :  '))

            if a1 == 1:
                sp.append(input('Пишите:  '))
            if a1 == 2:
                print(*sp)
            if a1 == 3:
                sp.append(input('Добавляйте:  '))
            if a1 == 4:
                sp == sp.clear()
            if a1 == 5:
                break

    if a == 5:
        break

"""# **Задача 4.**

Камень, ножницы, бумага

Создайте игру в Камень, ножницы, бумагу, в которой пользователь может играть против компьютера. Программа должна запросить выбор пользователя, а затем сгенерировать выбор компьютера. Затем программа должна определить победителя на основе правил игры.

**Этап 1:**

Определение победителя

**Этап 2:**
  
Игра до 3 побед


Ввод для "Этап 1":

```
Камень
```

Вывод:

```
Компьютер: Ножницы
Игрок: Камень
Победа: Игрок
```
"""

import random
while True:
    print('Привет!!! Это игра камень ножницы бумага, игра будет идти до 3 побед.')
    schet1 = 0
    schet = 0
    while schet1 < 3 and schet < 3:

        a = input('Введите свой ход(камень, ножницы, бумага): ')
        b = ['камень', "ножницы", "бумага"]
        b1 = random.choice(b)
        if a == 'камень' and b1 == 'камень':

            print("ничья")
            print(schet1, ':', schet)
        if a == 'камень' and b1 == 'ножницы':
            schet1 += 1
            print('вы выиграли')
            print(schet1, ':', schet)
        if a == 'камень' and b1 == 'бумага':
            schet += 1
            print("Вы проиграли")
            print(schet1, ':', schet)
        if a == 'ножницы' and b1 == 'камень':
            schet += 1
            print('вы проиграли')
            print(schet1, ':', schet)
        if a == 'ножницы' and b1 == 'ножницы':

            print("ничья")
            print(schet1, ':', schet)
        if a == 'ножницы' and b1 == 'бумага':
            schet1 += 1
            print('вы выиграли')
            print(schet1, ':', schet)
        if a == 'бумага' and b1 == 'камень':
            schet1 += 1
            print('вы выиграли')
            print(schet1, ':', schet)
        if a == 'бумага' and b1 == 'ножницы':
            schet += 1
            print('вы проиграли')
            print(schet1, ':', schet)
        if a == 'бумага' and b1 == 'бумага':

            print('ничья')
            print(schet1, ':', schet)
    if schet == 3:
        print('игру выиграл компьютер!!!')
    if schet1 == 3:
        print("вы выиграли игру!!")

"""# **Задача 5.**

Создайте игру "Палач" или "Виселица", в которой пользователь должен угадать слово, предлагая буквы. Программа должна выбрать случайное слово, а затем разрешить пользователю угадывать буквы. После каждого угадывания программа должна сообщать пользователю, есть ли в слове буква или нет.

**Этап 1**
Создать саму игру

**Этап 2:**
Ввести подсчет количества очков и ограничения на попытки

**Этап 3:** Добавить возможность сразу угадать слово
"""

import random
print('Привет!!!, это игра виселица!!!')

def f():
    words = ["яблоко", "корова", "виселица","палач", "игра"]
    return random.choice(words)

def f1(word, guess_1):
    d = ''.join(let if let in guess_1 else '_' for let in word)
    return f"загаданное слово: {d}"

def p():
    a = 0
    word = f()
    guess_1 = set()
    raz = 5



    while raz > 0:
        print(f1(word, guess_1))
        print(f"Осталось попыток: {raz}")

        guess = input("Введите букву, или слово целиком: ")
        if guess == word:
          print("Верно!!!")
          a += 1
          print("ваши очки:", a)
          break


        if len(guess) != 1:
            print("Пожалуйста, введите одну букву.")
            continue

        if guess in guess_1:
            print("Вы уже угадывали эту букву. Попробуйте другую.")
            continue

        guess_1.add(guess)

        if guess in word:
            print("Правильно!")

        else:
            print("Нет такой буквы.")
            raz -= 1

        if all(letter in guess_1 for letter in word):
            print(f"Поздравляем! Вы угадали слово: {word}")
            a += 1
            print("ваши очки:", a)
            break

    else:
        print(f"Вы проиграли. Загаданное слово было: {word}")
while True:
  p()



"""# **Дополнительно: Задача 6.**

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции


Вввод:

```
Введите номер позиции: 1234567890
```

Вывод:

```
8
```
"""

